app/views/articles/_form.html.erb

            <option value=""></option>
            <% Category.all.each do |cat| %>
---
SELECT "categories".* FROM "categories" ORDER BY name