app/views/articles/index.html.erb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
---
        <div class="span8">
            <% Article.order("created_at DESC").each do |article| %>