app/views/users/index.html.erb

SELECT "users".* FROM "users" LIMIT 5
---
              <tbody>
                <% User.limit(5).each do |user| %>