app/views/home/index.html.erb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT 1
---
		  		<div class="row micro carousel-head">
		  			<%= Article.last.user.username %> : </br>

SELECT "articles".* FROM "articles"
---
		</div>
	  	<% Article.all.each do |article| %>