app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @q = Article.search(params[:q])
    #@articles = @q.result(:distinct => true)
    @articles = @q.result(:distinct => true).paginate(:page => params[:page], :per_page => 5)

INSERT INTO "articles" ("category_id", "content", "created_at", "is_draft", "published_at", "slug", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save