app/controllers/home_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT 1
---
	def index
	  	@q = Article.search(params[:q])