app/controllers/journals_controller.rb

SELECT "journals".* FROM "journals"
---
  def index
    @journals = Journal.all